eventr/app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT "events".* FROM "events"

  def show
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "avatar_updated_at" = ?, "updated_at" = ?, "avatar_file_name" = ? WHERE "events"."id" = ?  [["avatar_updated_at", 2017-04-17 23:30:31 UTC], ["updated_at", 2017-04-17 23:30:31 UTC], ["avatar_file_name", "GuthrieacrossKeraly.jpg"], ["id", 1]]

  def create
    @event = Event.new(event_params)

    if @event.save
---
INSERT INTO "events" ("name", "description", "picurl", "date", "location", "price", "created_at", "updated_at", "time", "venue_style", "music_style", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]